# l1 = ['张力', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 500)]
# l2 = ['丁玲', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 100)]
# l3 = ['毛小', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 88)]
# l4 = ['王刚', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 200)]
# l5 = ['李云', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 100)]
#
# records = [l1, l2, l3, l4, l5]
# total = 0
# l3[0]='毛大'
# sum = 0.0000
# for i in records:
#     total = i[1][1] * i[1][2] + i[2][1] * i[2][2] + i[3][1] * i[3][2]
#     print('%s 同学投入 %f 元' % (i[0], total))
#     sum = sum + total
# print('编程小组总投入%f 元' % (sum))
class shiyan(object):
    def __init__(self):
        self.l1 = ['张力', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 500)]
        self.l2 = ['丁玲', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 100)]
        self.l3 = ['毛小', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 88)]
        self.l4 = ['王刚', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 200)]
        self.l5 = ['李云', ('笔记本电脑', 1, 5000), ('U盘', 1, 123), ('耳麦', 1, 100)]
    def group(self):
        records=[self.l1,self.l2,self.l3,self.l4,self.l5]
        sum=0.000000
        self.l3[0]= '毛大'
        for i in records:
            total = i[1][1] * i[1][2] + i[2][1] * i[2][2] + i[3][1] * i[3][2]
            print('%s 同学投入 %f 元' % (i[0], total))
            sum = sum + total
            result = ('编程小组总投入%f 元' % (sum))
        return result

if __name__ == '__main__':
    a=shiyan()
    p=a.group()
    print(p)